DDDSZY/S32K1X_MCAL_DEMO/S32K148_MCAL_DEMO/MCAL/Mcu_TS_T40D2M10I6R0/include/Reg_eSys_PMC.h
    #define PMC_SR_LVIS_MASK32                      (PMC_SR_RWBITS_MASK32)

#endif /* (IPV_PMC == IPV_PMC_01_00_02_05) */

#if (IPV_PMC == IPV_PMC_03_00_01_00)

    #define PMC_LVDSC1_NOT_SUPPORTED_U8        ((uint8)(0x00))
    #define PMC_LVDSC1_LVD_ENABLE_U8           ((uint8)(0x20))
    #define PMC_LVDSC1_LVD_DISABLE_U8          ((uint8)(0x00))

    #define PMC_LVDSC1_LVDRE_ENABLE_U8         ((uint8)(0x10))
    #define PMC_LVDSC1_LVDRE_DISABLE_U8        ((uint8)(0x00))

    #define PMC_LVDSC2_LVW_ENABLE_U8           ((uint8)(0x20))
    #define PMC_LVDSC2_LVW_DISABLE_U8          ((uint8)(0x00))
    
    #define PMC_LVDSC1_2_LVDACK_LVWACK_MASK32  ((uint32)(0x4040))
    #define PMC_LVDSC1_2_LVDIE_LVWIE_MASK32    ((uint32)(0x2020))
    #define PMC_LVDSC1_2_LVDF_LVWF_MASK32      ((uint32)(0x8080))
    #define PMC_LVDSC1_LVDF_MASK32             ((uint32)(0x80))
    #define PMC_LVDSC2_LVWF_MASK32             ((uint32)(0x8000))
    #define PMC_LVDSC1_LVDIE_MASK32            ((uint32)(0x20))
    #define PMC_LVDSC2_LVWIE_MASK32            ((uint32)(0x2000))
    
    #define PMC_REG_LVRFLG_MASK8               ((uint8)(0xDF))
    
    #define PMC_LVDSC1_LVDIE_MASK8             (PMC_LVDSC1_LVD_ENABLE_U8)
    #define PMC_LVDSC1_LVDF_MASK8              ((uint8)(0x80))
    #define PMC_LVDSC1_LVDACK_MASK8            ((uint8)(0x40))

    #define PMC_REG_RWBITS_MASK32              ((uint32)(0x1F832030))

    #define PMC_LVDSC1_LVDSC2_RWBITS_MASK32    ((uint32)(0x30200000))

    #define PMC_REGSC_LPO_ENABLE_U8            ((uint8)(0x00))
    #define PMC_REGSC_LPO_DISABLE_U8           ((uint8)(0x80))

    #define PMC_REGSC_BIAS_ENABLE_U8           ((uint8)(0x01))
    #define PMC_REGSC_BIAS_DISABLE_U8          ((uint8)(0x00))

    #define PMC_REGSC_CLKBIAS_DISABLE_U8       ((uint8)(0x02))
    #define PMC_REGSC_CLKBIAS_ENABLE_U8        ((uint8)(0x00))
    
    #define PMC_REGSC_LPOSTAT_MASK8            ((uint8)(0x40))
    #define PMC_REGSC_REGFPM_MASK8             ((uint8)(0x04))

    #define PMC_LPOTRIM_RWBITS_MASK8           ((uint8)(0x1F))
    /** @violates @ref Reg_eSys_PMC_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macros are used for register operations to improve readability.*/
    #define PMC_LPOTRIM_LPOTRIM_U8(value)      ((uint8)((uint8)(value) & PMC_LPOTRIM_RWBITS_MASK8))
#endif /* (IPV_PMC == IPV_PMC_03_00_01_00) */

#if (IPV_PMC == IPV_PMC_00_00_01_20)

    /***              PMC_SSR              ***/
    #define PMC_SSR_RWBITS_MASK32               ((uint32)0x0000007FU)
    #define PMC_SSR_LVD_VDDOSC_MASK32           ((uint32)0x00000040U)
    #define PMC_SSR_LVD_VDD3p3_MASK32           ((uint32)0x00000020U)
    #define PMC_SSR_HVD_VDDPMC_MASK32           ((uint32)0x00000010U)
    #define PMC_SSR_LVD_VDDPMC_MASK32           ((uint32)0x00000008U)
    #define PMC_SSR_HVD_HPVDD_MASK32            ((uint32)0x00000004U)
    #define PMC_SSR_LVD_HPVDD_MASK32            ((uint32)0x00000002U)
    #define PMC_SSR_POR_MASK32                  ((uint32)0x00000001U)

    /***              PMC_CR              ***/
    #define PMC_CR_RWBITS_MASK32                ((uint32)0x8000003FU)
    #define PMC_CR_VM_PMC_ENABLE_MASK32         ((uint32)0x80000000U)
    #define PMC_CR_LVD_VDDOSC_ENABLE_MASK32     ((uint32)0x00000020U)
    #define PMC_CR_LVD_VDD3p3_ENABLE_MASK32     ((uint32)0x00000010U)
    #define PMC_CR_HVD_VDDPMC_ENABLE_MASK32     ((uint32)0x00000008U)
    #define PMC_CR_LVD_VDDPMC_ENABLE_MASK32     ((uint32)0x00000004U)
    #define PMC_CR_HVD_HPVDD_ENABLE_MASK32      ((uint32)0x00000002U)
    #define PMC_CR_LVD_HPVDD_ENABLE_MASK32      ((uint32)0x00000001U)


    /***              PMC_REE              ***/
    #define PMC_REE_RWBITS_MASK32                ((uint32)0x8000003FU)
    
    #define PMC_REE_VM_PMC_RST_EN_MASK32         ((uint32)0x80000000U)
    #define PMC_REE_LVD_VDDOSC_RST_EN_MASK32     ((uint32)0x00000020U)
    #define PMC_REE_LVD_VDD3p3_RST_EN_MASK32     ((uint32)0x00000010U)
    #define PMC_REE_HVD_VDDPMC_RST_EN_MASK32     ((uint32)0x00000008U)
    #define PMC_REE_LVD_VDDPMC_RST_EN_MASK32     ((uint32)0x00000004U)
    #define PMC_REE_HVD_HPVDD_RST_EN_MASK32      ((uint32)0x00000002U)
    #define PMC_REE_LVD_HPVDD_RST_EN_MASK32      ((uint32)0x00000001U)
    
    /***              PMC_FEE              ***/
    #define PMC_FEE_RWBITS_MASK32                  ((uint32)0x0000003FU)
    #define PMC_FEE_LVD_VDDOSC_FAULT_EN_MASK32     ((uint32)0x00000020U)
    #define PMC_FEE_LVD_VDD3p3_FAULT_EN_MASK32     ((uint32)0x00000010U)
    #define PMC_FEE_HVD_VDDPMC_FAULT_EN_MASK32     ((uint32)0x00000008U)
    #define PMC_FEE_LVD_VDDPMC_FAULT_EN_MASK32     ((uint32)0x00000004U)
    #define PMC_FEE_HVD_HPVDD_FAULT_EN_MASK32      ((uint32)0x00000002U)
    #define PMC_FEE_LVD_HPVDD_FAULT_EN_MASK32      ((uint32)0x00000001U)
        
    /***              PMC_IEE              ***/
    #define PMC_IEE_RWBITS_MASK32                ((uint32)0x0000003FU)
    #define PMC_IEE_LVD_VDDOSC_INT_EN_MASK32     ((uint32)0x00000020U)
    #define PMC_IEE_LVD_VDD3p3_INT_EN_MASK32     ((uint32)0x00000010U)
    #define PMC_IEE_HVD_VDDPMC_INT_EN_MASK32     ((uint32)0x00000008U)
    #define PMC_IEE_LVD_VDDPMC_INT_EN_MASK32     ((uint32)0x00000004U)
    #define PMC_IEE_HVD_HPVDD_INT_EN_MASK32      ((uint32)0x00000002U)
    #define PMC_IEE_LVD_HPVDD_INT_EN_MASK32      ((uint32)0x00000001U)
#endif

#if (IPV_PMC == IPV_PMC_00_00_00_15)

    /***              PMC_TS_IER              ***/
    #define PMC_TS_IER_RWBITS_MASK32                    ((uint32)0x8000001BU)
    #define PMC_TS_IER_RWBITS_USR_MASK32                ((uint32)0x0000001BU)
                                                        
    #define PMC_TS_IER_RESBITS_MASK32                   ((uint32)0x00000000U)
                                                        
    #define PMC_TS_IER_TS_EN_MASK32                     ((uint32)0x80000000U)
    #define PMC_TS_IER_TS1_2IE_MASK32                   ((uint32)0x00000010U)
    #define PMC_TS_IER_TS1_0IE_MASK32                   ((uint32)0x00000008U)
    #define PMC_TS_IER_TS0_2IE_MASK32                   ((uint32)0x00000002U)
    #define PMC_TS_IER_TS0_0IE_MASK32                   ((uint32)0x00000001U)

